cfg/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Documents/УстановкаЦенНоменклатуры/Ext/ManagerModule.bsl
Функция Печать(Ссылка) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет("УстановкаЦен");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Номер = Ссылка.Номер;
	ОбластьЗаголовок.Параметры.Дата = Ссылка.Дата;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены КАК ВидЦены,
		|	УстановкаЦенНоменклатурыНоменклатура.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыНоменклатура.Цена КАК Цена
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатурыВидыЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры.Номенклатура КАК УстановкаЦенНоменклатурыНоменклатура
		|		ПО УстановкаЦенНоменклатурыВидыЦен.КлючСвязи = УстановкаЦенНоменклатурыНоменклатура.КлючСвязи
		|ГДЕ
		|	УстановкаЦенНоменклатурыВидыЦен.Ссылка = &Ссылка
		|	И УстановкаЦенНоменклатурыНоменклатура.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Цена)
		|ПО
		|	ВидЦены,
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьНачало = Макет.ПолучитьОбласть("Шапка|Номенклатура");
	ОбластьВидЦены = Макет.ПолучитьОбласть("Шапка|ВидЦены");
	
	ТабДок.Вывести(ОбластьНачало);
	
	ВыборкаВидЦены = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидЦены.Следующий() Цикл
		ОбластьВидЦены.Параметры.Заполнить(ВыборкаВидЦены);
		ТабДок.Присоединить(ОбластьВидЦены);
	КонецЦикла;
	
	ОбластьНачало = Макет.ПолучитьОбласть("Строка|Номенклатура");
	ОбластьВидЦены = Макет.ПолучитьОбласть("Строка|ВидЦены");
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ОбластьНачало.Параметры.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ТабДок.Вывести(ОбластьНачало);
		ВыборкаВидЦены = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидЦены", "ВСЕ");
		
		Пока ВыборкаВидЦены.Следующий() Цикл
			ОбластьВидЦены.Параметры.Заполнить(ВыборкаВидЦены);
			ТабДок.Присоединить(ОбластьВидЦены);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
